tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mulle-kybernetik/software"

# Tmux 3.3 introduced an issue in my tmux + vim + iterm where cursors would not
# update between insert and normal mode.
# https://github.com/tmux/tmux/issues/3218
tap "soulfresh/homebrew", "git@github.com:soulfresh/homebrew-homebrew.git"

# brew "python@3.9"
# brew "python@3.11"
# brew "python@3.10"

# General Development Tools
brew "git"
# Github issues commandline
# brew "ghi"
# Add GitHub support to git cli
# brew "hub"
# brew "circleci"
brew "ctags"
brew "neovim"
# brew "tmux"
brew "zsh"
cask "neovide"
# used for the `realpath` command used by our install script
brew "coreutils"

# Web Development Tools
# I think nvm will take care of this for me
# brew "node"
# brew "postgresql@14"
# brew "mysql@5.7"
# brew "redis"
brew "yarn"
brew "tidy-html5"
# cask "google-cloud-sdk"

# iOS Development Tools
# brew "cocoapods"

# Android Development Tools
# cask "android-studio"

# C/C++ stuff
# brew "boost"
# brew "glib"
# brew "glew"
brew glslang
# brew "gobject-introspection"
brew "cmake"
brew "llvm"
brew "ninja"
# HTTP2 implementation in C
# brew "nghttp2"

# Languages
# Rust
# brew "rust"
# Tool Command Language
# brew "tcl-tk", link: false

# General
# DNS
brew "libidn2"
# TLS
brew "gnutls"
# Compression/Zip/Archive
brew "libarchive"

# Graphing tools
# brew "cairo"
# brew "harfbuzz"
# brew "graphviz"

# Image utlitiles
# brew "graphicsmagick"
# brew "imagemagick"

# Video
brew "libass"
# Secure Reliable Transport
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "libheif"

# Search
# TODO Are we still using fzf?
brew "fzf"
# Used by nvim Telescope
brew "ripgrep"
# brew "the_silver_searcher"

# Networking
# Kerberos network auth
# brew "krb5"
# DNS
# brew "unbound"

# Watchman
brew "watchman"
brew "edencommon"
# FB stuf. Watchman?
# brew "folly"
# brew "fizz"
# brew "wangle"
# brew "fbthrift"
# brew "fb303"

# PDFs
# brew "ghostscript"
# brew "poppler"

# Spell checker
# brew "hunspell"

# DB of common mime types
# brew "shared-mime-info"

